package com.mirim.bokrim.Datas;

import java.util.List;

public class HistoryList {
    public static List<History> historyList =
            List.of(
                    new History(0, "한복의 등장", "한복의 등장은 고구려 벽화에서 찾아볼 수 있다. 벽화에는 남성과 여성이 모두 저고리와 비슷한 상의와 함께 바지나 치마를 입고 있다", "한복의 등장은 고구려 벽화에서 찾아볼 수 있다. 벽화에는 남성과 여성이 모두 저고리와 비슷한 상의와 함께 바지나 치마를 입고 있다. 또한, 신분이나 직업에 따라 의복의 형태가 다르게 표현된다. 남성은 저고리와 바지, 여성은 저고리와 치마를 입었다. 추가적으로 그 위에 예의나 격식을 갖추기 위해 두루마기형 포를 더 입었다."),
                    new History(1, "백제와 신라의 한복", "백제와 신라의 복식도 고구려와 유사하지만 의복의 넓이나 색채, 머리에 쓰는 물건들의 장식에서 차이가 있었던 것으로 알려져 있다.", "신라가 한반도를 통일하면서 의복에는 한국 고유의 양식과 중국에서 들여온 외래 양식의 복식이 함께 하는 현상이 나타났다. 한국 고유 의복의 목선이 깃이 곧은 직령이라면, 외래 복식은 깃을 둥글게 만든 포인 단령인 것이 가장 큰 특징이다."),
                    new History(2, "고려의 한복", "고려시대에 접어들며 평민들은 여전히 신라의 복식을 이어받아 생활하였지만, 지배계층은 중국의 영향으로 그들의 복식제도를 들여와 고려의 제도를 만들면서 왕과 관료들의 옷에 변화가 있었다.", "고려시대에 접어들며 평민들은 여전히 신라의 복식을 이어받아 생활하였지만, 지배계층은 중국의 영향으로 그들의 복식제도를 들여와 고려의 제도를 만들면서 왕과 관료들의 옷에 변화가 있었다. 특히, 고려 후기 원나라의 간섭기 시기에는 몽고풍이라 하여 원의 풍습이 고려에서 유행하였다. 이 때 영향 받은 풍속과 복식이 지금까지 남아 있기도 하며, 남녀 모두 모시로 만든 백저포가 유행하였다."),
                    new History(3, "조선의 한복", "고려와 조선시대를 거치면서 한복은 여러 양식으로 변화하다가, 현재 한복의 모습은 조선시대에 이르러서 정착되었다.", "현재 한복의 모습은 조선시대에 이르러서 정착되었다. 복식에서도 계층적 신분 질서를 여실히 보여주었는데 조선 초 스란치마가 유행하였으나 신분 계층이 높은 사람들만 입을 수 있었다. 또한, 의복에 사용된 문양이나, 소재, 장신구 등 미묘한 부분에서 차이를 두어 신분의 차이를 알아볼 수 있게 하였다. 조선 중기부터는 대체적으로 등길이가 길어 허리 밑까지 내려올 정도였으나 이는 시간이 갈수록 짧아져 거의 가슴을 덮지 않을 정도가 되었다. 치마의 경우 조선시대 전반에 걸쳐 길고 풍성한 느낌이었으며, 폭도 넓어져 종 모양처럼 엉덩이 부분만이 살짝 부푼 모습을 띄었다."),
                    new History(4, "현대의 한복", "1880년대 이후 양복의 영향을 받아 주머니가 없는 한복의 단점을 보완해 주머니를 단 조끼가 유행했다.", "1880년대 이후 양복의 영향을 받아 주머니가 없는 한복의 단점을 보완해 주머니를 단 조끼가 유행했다. 우리나라에는 서구문물이 물밀 듯이 들어오기 시작하며, 양복이 들어왔고 이때부터 한복과 양복을 혼용해서 입었다. 여성들도 짧은 통치마에 흰 저고리를 입어 개량한복의 시초가 되었다. 사회가 변화하면서 여성을 억압했던 장의와 쓰개치마에 대한 폐지 운동도 전개되었다. 1960년대와 1970년대를 거쳐 급속한 경제개발 및 서구식 문화의 유입으로 인해 한복은 점차 우리의 주변에서 자리를 잃어갔다.")
            );
}
