package com.mirim.bokrim.Datas;

import java.util.List;

public class StoreList {


    public static List<Store> storeList =
            List.of(
                    new Store(0, "대한한복", "서울특별시 관악구 조원로18길 15", 37.4835316, 126.9126295, "일 10:00 - 18:00\n월 정기휴무 (매주 월요일)\n화 10:00 - 20:00\n수 10:00 - 20:00\n목 10:00 - 20:00\n금 10:00 - 20:00\n토 10:00 - 20:00", "http://instagram.com/1.5_do_c", "0507-1355-9173"),
                    new Store(1, "한복쓰제이", "경상남도 밀양시 삼문송림길 5-7", 35.4877365, 128.7560629, "일 정기휴무 (매주 일요일)\n월 정기휴무 (매주 월요일)\n화 11:00 - 18:00\n수 11:00 - 18:00\n목 11:00 - 18:00\n금 11:00 - 18:00\n토 11:00 - 18:00", "https://naver.me/50pGYRah", "055-352-5710"),
                    new Store(2, "갤러리한복", "서울특별시 영등포구 선유로3길 10 하우스디 비즈", 37.5164363, 126.8868107, "일 정기휴무 (매주 일요일)\n월 11:00 - 19:00\n화 11:00 - 19:00\n수 11:00 - 19:00\n목 11:00 - 19:00\n금 11:00 - 19:00\n토 11:00 - 19:00", "https://smartstore.naver.com/gallerydim", "02-3667-1108"),
                    new Store(3, "한복마켓", "경상남도 거제시 옥포로23길 5 영진그린빌라", 34.8952771, 128.6900421, "일 정기휴무 (매주 일요일)\n월 9:00 - 17:00\n화 9:00 - 17:00\n수 9:00 - 17:00\n목 9:00 - 17:00\n금 9:00 - 17:00\n토 9:00 - 17:00", "https://naver.me/G2UAqzHl", "055-687-5891"),
                    new Store(4, "마가한복", "서울특별시 강동구 상암로3길 24 뱅크빌딩", 37.5510618, 127.1249265, "일 정기휴무 (매주 일요일)\n월 9:00 - 18:00\n화 정기휴무 (매주 화요일)\n수 9:00 - 18:00\n목 정기휴무 (매주 목요일)\n금 9:00 - 18:00\n토 정기휴무 (매주 토요일)", "https://www.instagram.com/gonggi_2020", "010-9948-0716"),
                    new Store(5, "Art&Hanbok", "대전광역시 유성구 대덕대로 516 대전유성소방서", 36.3751677, 127.3819045, "일 10:30 - 20:30\n월 10:30 - 20:00\n화 10:30 - 20:00\n수 10:30 - 20:00\n목 10:30 - 20:00\n금 10:30 - 20:30\n토 10:30 - 20:30", "https://naver.me/GGh8EnOI", "1588-1234"),
                    new Store(6, "더 커먼", "대구광역시 중구 국채보상로140길 33", 35.8673994, 128.6063935, "일 11:30 - 20:30\n월 정기휴무 (매주 월요일)\n화 11:30 - 20:30\n수 11:30 - 20:30\n목 11:30 - 20:30\n금 11:30 - 20:30\n토 11:30 - 20:30", "https://www.instagram.com/common.for.green/", "070-8065-7795"),
                    new Store(7, "수향한복", "서울특별시 영등포구 여의대로 108 파크원", 37.5258975, 126.9284261, "일 10:30 - 20:30\n월 10:30 - 20:00\n화 10:30 - 20:00\n수 10:30 - 20:00\n목 10:30 - 20:00\n금 10:30 - 20:30\n토 10:30 - 20:30", "http://www.thehyundaiseoul.com", "02-767-2233"),
                    new Store(8, "덕분愛", "서울특별시 서초구 서초대로 389 진흥상가", 37.5026383, 127.0229664, "일 정기휴무 (매주 일요일)\n월 12:00 - 20:00\n화 12:00 - 20:00\n수 12:00 - 20:00\n목 12:00 - 20:00\n금 12:00 - 20:00\n토 12:00 - 20:00", "http://www.thanksto.co.kr", "02-6959-4479"),
                    new Store(9, "도돌이한복", "경기도 시흥시 은계호수로 49 시흥 센트럴돔 그랑트리 캐슬", 37.44543130000017, 126.8020503999999, "일 정기휴무 (매주 일요일)\n월 정기휴무 (매주 월요일)\n화 11:00 - 19:00\n수 11:00 - 19:00\n목 11:00 - 19:00\n금 11:00 - 19:00\n토 11:00 - 17:00", "https://www.instagram.com/dodori_store", "0507-1308-8907"),
                    new Store(10, "한복상점", "경기도 성남시 분당구 판교로33번길 9", 37.39023, 127.0843454, "일 정기휴무 (매주 일요일)\n월 13:00 - 17:00\n화 13:00 - 17:00\n수 13:00 - 17:00\n목 13:00 - 17:00\n금 13:00 - 17:00\n토 13:00 - 17:00", "http://donggramirefillery.com", "0507-1346-3447"),
                    new Store(11, "디어한복", "서울특별시 광진구 아차산로65길 22", 37.5412316, 127.093786, "일 11:00 - 18:00\n월 정기휴무 (매주 월요일)\n화 정기휴무 (매주 화요일)\n수 정기휴무 (매주 수요일)\n목 정기휴무 (매주 목요일)\n금 정기휴무 (매주 금요일)\n토 11:00 - 18:00", "http://instagram.com/dear.eco", "0507-1337-5180"),
                    new Store(12, "혜성한복", "서울특별시 마포구 대흥로24길 24", 37.55349819999966, 126.92996269999993, "일 15:00 - 19:00\n월 정기휴무 (매주 월요일)\n화 11:00 - 20:00\n수 11:00 - 20:00\n목 11:00 - 20:00\n금 11:00 - 20:00\n토 11:00 - 20:00", "https://www.instagram.com/bottleandscoop", "0507-1355-5318"),
                    new Store(13, "맹꽁이한복", "경기도 시흥시 하중로173번길 22", 37.39517220000024, 126.80028109999955, "일 00:00 - 00:10\n월 10:30 - 19:00\n화 10:30 - 19:00\n수 10:30 - 19:00\n목 10:30 - 19:00\n금 10:30 - 19:00\n토 10:30 - 17:00", "https://www.instagram.com/maeng.store", "070-7798-1732"),

                    new Store(14, "한복공간", "경기도 성남시 중원구 원터로105번길 5-1", 37.43579349999984, 127.13781019999944, "10:30 - 20:30\n매주 화요일 정기휴무", "https://www.instagram.com/harmless_space/", "0507-1362-3074"),
                    new Store(15, "물푸레한복", "서울특별시 은평구 진관4로 48-51 은평뉴타운 상림마을", 37.6436341, 126.9295435, "10:00 - 18:00\n매주 일요일 정기휴무", "https://www.instagram.com/bookcafemulpure/", "02-356-9410"),
                    new Store(16, "한복라운지", "서울특별시 서대문구 홍연길 26", 37.5751488, 126.9284689, "10:00 - 21:00\n매주 월요일 정기휴무", "https://www.instagram.com/bottle_factory/", "02-3144-0703"),
                    new Store(17, "바리한복", "서울특별시 동작구 노량진로 10 여성가족복합시설 스페이스살림", 37.5126411, 126.9271976, "휴업중", "https://www.bgreen.co.kr/", "0507-1418-2042"),
                    new Store(18, "다기한복", "서울특별시 서초구 방배로42길 31-4 102호", 37.49471279999987, 126.98617529999933, "10:00 - 17:00\n매주 일요일 월요일 정기휴무", "없음", "02-6242-5189"),
                    new Store(19, "수미한복", "경기도 성남시 수정구 위례광장로 21 가하빌딩", 37.46693, 127.141592, "주중 12:00 - 30:00\n주말 12:30 - 18:00\n매주 수요일, 마지막 화요일 정기휴무", "https://www.instagram.com/soaprefillstation_wirye/", "010-4936-5049"),
                    new Store(20, "꽃다랑 본점", "서울특별시 중구 소공로 63 신세계백화점건물", 37.5611141, 126.9812404, "10:30 - 20:00", "www.shinsegae.com/store", "1588-1234"),
                    new Store(21, "별진각", "충청북도 청주시 상당구 중고개로141번길 14-2", 36.617503900000074, 127.51223829999951, "11:00 - 20:00\n매주 월요일 정기휴무", "https://www.instagram.com/singleroom_official_/", "0507-1333-6206"),
                    new Store(22, "구르미 한복", "서울특별시 성북구 성북로8길 11", 37.59109129999997, 127.00024329999951, "11:00 - 21:00\n매주 수요일 정기휴무", "https://atomos-store.kr/", "02-6012-2102"),
                    new Store(23, "에르마나스", "강원도 원주시 남원로469번길 14-2", 37.32799329999958, 127.93861699999952, "13:00 - 17:00\n매주 토요일 일요일 정기휴무", "http://instagram.com/hermanas__2019", "0507-1321-2317"),
                    new Store(24, "올가홀", "서울특별시 송파구 양재대로71길 4 올가홀푸드", 37.51039169999978, 127.12220329999998, "10:00 - 22:00", "https://shop.pulmuone.co.kr/orga", "02-418-6255"),
                    new Store(25, "담아가게", "경기도 남양주시 와부읍 덕소로97번길 9 일신프라자", 37.58611369999992, 127.2131738999997, "월 10:00-19:00\n 화 10:00-18:00\n 수 10:00-19:00\n 목 10:00-18:00\n 금 10:00-18:00\n 토 정기휴무\n 일 정기휴무", "http://zerowasteshop.modoo.at", "0507-1458-2403"),
                    new Store(26, "용기상점", "강원도 삼척시 청석로 83-19", 37.44859440000003, 129.17377259999986, "11:30 - 19:00 매주 토 일 정기휴무", "https://www.instagram.com/yonggi_store", "0507-1377-0244"),
                    new Store(27, "우슬레", "서울특별시 강동구 성안로 87", 37.5313332, 127.1322353, "11:30 - 20:00 매주 토 일 정기휴무", "https://usle.kr/", "070-4320-9697"),
                    new Store(28, "환", "서울특별시 강북구 인수봉로23길 37", 37.6275787, 127.0108167, "10:00 - 20:00 매주 월 화 정기휴무", "http://www.innopace.co.kr/4D/hwanjang/index.html", "0507-1335-7015"),

                    new Store(29, "한복스테이", "대구광역시 달서구 진천로 114-17", 35.8193337, 128.5223126, "10:00 - 18:00\n일 정기휴무", "http://instagram.com/zerostay_", "0507-1357-4123"),
                    new Store(30, "한복에이블", "경기도 안양시 동안구 동편로27번길 7", 37.4067135, 126.9722788, "11:00 - 2:00", "http://zeroable.co.kr/", "031-425-2252"),
                    new Store(31, "화도", "경기도 의정부시 용민로 419 (라디언트캐슬) 1204동 2103호", 37.755921, 127.1147296, "11:00 - 18:00\n일 정기휴무", "https://www.instagram.com/eco_janne/", "010-8299-1119"),
                    new Store(32, "월일가게", "서울특별시 노원구 광운로 53 니아미트어린이집", 37.62242150000016, 127.05518709999998, "일 정기휴무\n월 정기휴무\n화 13:00 - 19:30\n수 13:00 - 19:30\n목 13:00 - 19:30\n금 13:00 - 19:30\n토 14:00 - 19:30", "https://www.instagram.com/jigurang_shop", "0507-1473-7993"),
                    new Store(33, "지소남", "서울특별시 마포구 성미산로 155", 37.5645561, 126.9235021, "11:00 - 21:30\n매달 첫번째 화요일 정기휴무", "http://www.jigushop.co.kr", "070-7721-5748"),
                    new Store(34, "초록숲상점", "경기도 평택시 용죽6길 22", 36.99344439999993, 127.12426609999993, "일 정기휴무 (매주 일요일)\n월 정기휴무 (매주 월요일)\n화 12:00 - 19:00\n수 12:00 - 19:00\n목 12:00 - 19:00\n금 12:00 - 19:00\n토 12:00 - 16:00", "http://www.instagram.com/choroksoup_store", "0507-1454-0046"),
                    new Store(35, "코뿔소한복", "경기도 김포시 김포한강11로438번길 123 하늘빛마을 한신더휴테라스", 37.6512804, 126.6951956, "일 정기휴무 (매주 일요일)\n월 정기휴무 (매주 월요일)\n화 10:00 - 18:00\n수 10:00 - 18:00\n목 10:00 - 18:00\n금 10:00 - 21:00\n토 10:00 - 18:00", "https://www.instagram.com/dreambookshop.rhino", "0507-1331-5427"),
                    new Store(36, "플래닛어스", "인천광역시 연수구 인천타워대로 257 아트포레", 37.3936653, 126.6329588, "매일 09:00 - 21:00", "https://www.instagram.com/planetus_world", "0507-1347-0393"),
                    new Store(37, "꼭꼭가게", "충청남도 천안시 서북구 불당23로 73-27", 36.82042239999967, 127.10549769999997, "일 정기휴무 (매주 일요일)\n월 11:00 - 18:00\n화 11:00 - 18:00\n수 11:00 - 18:00\n목 11:00 - 18:00\n금 11:00 - 18:00\n토 14:00 - 18:00", "https://map.naver.com/v5/entry/place/1948892761?c=14149319.2809896,4414105.4572763,15,0,0,0,dh", "041-555-0801"),
                    new Store(38, "핸드메이드라이프", "제주특별자치도 서귀포시 대정읍 상모로 256", 33.2240501, 126.2617836, "일 11:00 - 18:00\n월 11:00 - 18:00\n화 정기휴무 (매주 화요일)\n수 11:00 - 18:00\n목 11:00 - 18:00\n금 11:00 - 18:00\n토 11:00 - 18:00", "http://www.instagram.com/handmadelife79", "010-9620-1351"),
                    new Store(39, "허그어웨일", "서울특별시 강서구 화곡로55길 23", 37.5526993, 126.8483948, "일 10:30 - 17:00\n월 10:30 - 18:00\n화 10:30 - 18:00\n수 10:30 - 18:00\n목 10:30 - 18:00\n금 10:30 - 18:00\n토 10:30 - 17:00", "http://instagram.com/hug_a_whale", "02-2038-7209"),
                    new Store(40, "후곡한복", "경기도 고양시 일산서구 후곡로 58 후곡마을3단지", 37.68202039999978, 126.76170879999977, "일 11:00 - 14:00\n월 정기휴무 (매주 월요일)\n화 12:00 - 18:00\n수 12:00 - 18:00\n목 12:00 - 18:00\n금 12:00 - 18:00\n토 12:00 - 18:00", "https://www.instagram.com/greenstore_hugok", "010-4769-8558"),
                    new Store(41, "안동한복", "서울특별시 마포구 월드컵로 25길 47 3층", 37.557761, 126.9052787, "일 12:00 - 20:00\n월 정기휴무 (매주 월요일)\n화 12:00 - 20:00\n수 12:00 - 20:00\n목 12:00 - 20:00\n금 12:00 - 20:00\n토 12:00 - 20:00", "https://blog.naver.com/almangmarket", "010-2229-1027"),
                    new Store(42, "삼척한복", "서울특별시 중구 한강대로 405, 서울역 4층 야외주차장 옥상정원 나무건물", 37.555042, 126.9695336, "일 12:00 - 21:00\n월 정기휴무 (매주 월요일)\n화 12:00 - 21:00\n수 12:00 - 21:00\n목 12:00 - 21:00\n금 12:00 - 21:00\n토 12:00 - 21:00", "https://blog.naver.com/almangmarket", "070-7777-1925")
            );


}